[
  {
    "type": "effect_type",
    "id": "skyisland_resurrection_sickness",
    "name": [ "Resurrection Sickness" ],
    "desc": [ "Your body is recovering from death. Your limbs are being forcibly stabilized by mysterious energies." ],
    "rating": "bad",
    "max_intensity": 1,
    "int_dur_factor": "10 s",
    "max_duration": "10 s",
    "decay_messages": [
      [ "Your body has stabilized.", "bad" ]
    ],
    "miss_messages": [
      [ "You feel your body forcibly reconstructing itself!", 3 ]
    ]
  },
  {
    "type": "effect_type",
    "id": "skyisland_warpsickness",
    "name": [
      "Warp Stability",
      "Warp Sickness",
      "Warp Nausea",
      "Warp Debilitation",
      "Warp Necrosis",
      "Warp Disintegration!"
    ],
    "desc": [
      "You're fresh from your stay at your sanctuary island.  The intangible miasma of terra firma currently has no effect on you, and you feel fine.  This should last for several hours.  Stay too long, however, and you'll gradually begin to suffer ever-worsening debilitating effects.",
      "You've overstayed your time earthside.  It's getting hard to concentrate, there's a painful ringing in your ears, and your muscles sting and jolt.  Every action feels delayed.  You need to warp home to refresh yourself, or this is going to get worse.  Probably within just a few hours.",
      "You've stayed earthside too long.  Your body aches and your senses are dulling.  Every step feels like you're walking through thick mud and breathing hot tar.  You should warp home as soon as you can, or this is only going to get worse.",
      "You've stayed earthside WAY too long!  Your body barely responds and your senses are slush.  The world itself feels barbed and frayed, and the very air is like breathing fiberglass.  If you want to survive, you need to warp home as soon as possible.",
      "The very fabric of your being is unraveling!  You're in dire straits.  You need to get back to your sanctuary island NOW!",
      "You're going to die.  And if you weren't busy leaking blood out of every pore, you'd find a better way to emphasize just how badly you're dying.  Your only hope is to return home immediately."
    ],
    "rating": "mixed",
    "max_intensity": 6,
    "int_add_val": 1,
    "base_mods": { "str_mod": [ 0 ], "dex_mod": [ 0 ], "per_mod": [ 0 ], "int_mod": [ 0 ] },
    "scaling_mods": { "str_mod": [ -2 ], "dex_mod": [ -2 ], "per_mod": [ -2 ], "int_mod": [ -2 ] }
  },
  {
    "id": "skyisland_warpdisintegration",
    "type": "effect_type",
    "name": [ "Disintegrating!" ],
    "desc": [ "Prolonged warp is destroying you.  You're coming apart." ],
    "apply_message": "You're being unmade!",
    "remove_message": "The rending of the warp has finally abated.  You feel like you exist again.",
    "rating": "bad",
    "max_intensity": 1,
    "base_mods": {
      "pain_amount": [ 5 ],
      "pain_min": [ 1 ],
      "pain_chance": [ 20 ],
      "pain_max_val": [ 100 ],
      "hurt_amount": [ 5 ],
      "hurt_min": [ 1 ],
      "hurt_chance": [ 1 ],
      "hurt_tick": [ 20 ]
    }
  }
]
